# StairsDbgShowLandingBoundary Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsDbgShowLandingBoundary Property
ParameterTypeId Class See Also
---
"Show Landing Boundary"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsDbgShowLandingBoundary { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsDbgShowLandingBoundary As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsDbgShowLandingBoundary {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace